memcopy:
  ;-------------------
  ;スタックフレームの構築
  ;-------------------
                  ; BP + 8 バイト数
                  ;    + 6 コピー元
                  ;    + 4 コピー先
  push bp         ;    + 2 戻り番地
  mov bp, sp      ;    + 0 BPの元の値
  
  ;====================
  ;レジスタの保存
  ;====================
  push cx
  push si
  push di

  ;====================
  ;バイト単位でコピー
  ;====================
  cld
  mov di, [bp + 4]
  mov si, [bp + 6]
  mov cx, [bp + 8]

  rep movsb

  ;====================
  ;レジスタの復帰
  ;====================
  pop di
  pop si
  pop cx

  ;====================
  ;スタックフレームの破棄
  ;====================
  mov sp,bp
  pop bp

  ret